In [3]:
import pandas as pd
import numpy as np

In [4]:
data = np.random.randn(4,3)

In [5]:
data

array([[ 1.12617977, -0.65451494,  1.32065038],
       [-0.07885163, -1.37955264,  1.77514125],
       [-0.14551027, -0.91350231,  1.5155935 ],
       [ 0.29948211, -0.2014105 ,  0.99394829]])

In [6]:
dataFrame = pd.DataFrame(data)

In [7]:
dataFrame

          0         1         2
0  1.126180 -0.654515  1.320650
1 -0.078852 -1.379553  1.775141
2 -0.145510 -0.913502  1.515593
3  0.299482 -0.201410  0.993948

In [8]:
dataFrame[0]

0    1.126180
1   -0.078852
2   -0.145510
3    0.299482
Name: 0, dtype: float64

In [11]:
yeniDataFrame = pd.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"],columns=["Maas","Yas","Calisma Saati"])

In [12]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    1.126180 -0.654515       1.320650
Zeynep -0.078852 -1.379553       1.775141
Atlas  -0.145510 -0.913502       1.515593
Mehmet  0.299482 -0.201410       0.993948

In [9]:
yeniDataFrame["Yas"]

Atil      1.052658
Zeynep   -0.526607
Atlas    -0.680627
Mehmet   -0.997580
Name: Yas, dtype: float64

In [10]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Atil    0.537120  1.052658
Zeynep  0.713527 -0.526607
Atlas  -0.372737 -0.680627
Mehmet  0.021703 -0.997580

In [11]:
yeniDataFrame.loc["Atil"] #loc yazmazsan saatırlara ulaşamazsın

Maas             0.537120
Yas              1.052658
Calisma Saati   -0.571621
Name: Atil, dtype: float64

In [12]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [13]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.537120  1.052658      -0.571621        2.105316
Zeynep  0.713527 -0.526607      -0.283182       -1.053214
Atlas  -0.372737 -0.680627       1.795751       -1.361254
Mehmet  0.021703 -0.997580      -1.855344       -1.995159

In [14]:
yeniDataFrame.drop("Emeklilik Yasi",axis = 1)

            Maas       Yas  Calisma Saati
Atil    0.537120  1.052658      -0.571621
Zeynep  0.713527 -0.526607      -0.283182
Atlas  -0.372737 -0.680627       1.795751
Mehmet  0.021703 -0.997580      -1.855344

In [15]:
yeniDataFrame.drop("Mehmet") #axis eksen denir

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.537120  1.052658      -0.571621        2.105316
Zeynep  0.713527 -0.526607      -0.283182       -1.053214
Atlas  -0.372737 -0.680627       1.795751       -1.361254

In [16]:
yeniDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil    0.537120  1.052658      -0.571621        2.105316
Zeynep  0.713527 -0.526607      -0.283182       -1.053214
Atlas  -0.372737 -0.680627       1.795751       -1.361254
Mehmet  0.021703 -0.997580      -1.855344       -1.995159

In [17]:
yeniDataFrame.drop("Emeklilik Yasi",axis = 1,inplace=True) #inplace sayesinde gerçektende değişim sağlanabiliyor

In [18]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil    0.537120  1.052658      -0.571621
Zeynep  0.713527 -0.526607      -0.283182
Atlas  -0.372737 -0.680627       1.795751
Mehmet  0.021703 -0.997580      -1.855344

In [19]:
yeniDataFrame < 0

         Maas    Yas  Calisma Saati
Atil    False  False           True
Zeynep  False   True           True
Atlas    True   True          False
Mehmet  False   True           True

In [20]:
booleanFrame = yeniDataFrame < 0

In [21]:
yeniDataFrame[booleanFrame]

            Maas       Yas  Calisma Saati
Atil         NaN       NaN      -0.571621
Zeynep       NaN -0.526607      -0.283182
Atlas  -0.372737 -0.680627            NaN
Mehmet       NaN -0.997580      -1.855344

In [22]:
yeniDataFrame[yeniDataFrame < 0]

            Maas       Yas  Calisma Saati
Atil         NaN       NaN      -0.571621
Zeynep       NaN -0.526607      -0.283182
Atlas  -0.372737 -0.680627            NaN
Mehmet       NaN -0.997580      -1.855344

In [23]:
yeniDataFrame[yeniDataFrame["Yas"]>0]

         Maas       Yas  Calisma Saati
Atil  0.53712  1.052658      -0.571621

In [24]:
yeniDataFrame.reset_index()

    index      Maas       Yas  Calisma Saati
0    Atil  0.537120  1.052658      -0.571621
1  Zeynep  0.713527 -0.526607      -0.283182
2   Atlas -0.372737 -0.680627       1.795751
3  Mehmet  0.021703 -0.997580      -1.855344

In [25]:
yeniIndeksListesi = ["Ati","Zey","Atl","Meh"]

In [26]:
yeniDataFrame["Yeni Indeks"] = yeniIndeksListesi

In [27]:
yeniDataFrame

            Maas       Yas  Calisma Saati Yeni Indeks
Atil    0.537120  1.052658      -0.571621         Ati
Zeynep  0.713527 -0.526607      -0.283182         Zey
Atlas  -0.372737 -0.680627       1.795751         Atl
Mehmet  0.021703 -0.997580      -1.855344         Meh

In [28]:
yeniDataFrame.set_index("Yeni Indeks",inplace=True)

In [29]:
yeniDataFrame

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati          0.537120  1.052658      -0.571621
Zey          0.713527 -0.526607      -0.283182
Atl         -0.372737 -0.680627       1.795751
Meh          0.021703 -0.997580      -1.855344

In [30]:
ilkIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [31]:
icIndeksler =["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [32]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [33]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [34]:
benimCizgiFilmListem = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [35]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [37]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndeks,columns=["Yas","Meslek"])

In [38]:
cizgiFilmDataFrame

                      Yas Meslek
(Simpson, Homer)       40      A
(Simpson, Bart)        10      B
(Simpson, Marge)       30      C
(South Park, Cartman)   9      D
(South Park, Kenny)    10      E
(South Park, Kyle)     11      F